In [107]:
#import pachages and modules
import pandas as pd
import os 
import numpy as np

In [108]:
#school_data_to_load = 'resources/schools_complete.csv'
#students_data_to_load = 'resources/students_complete.csv'

In [109]:
#import data csv
schools_data = pd.read_csv('resources/schools_complete.csv')
students_data = pd.read_csv('resources/students_complete.csv')

In [110]:
# create school data frames
schools_data_df =pd.DataFrame(schools_data)
schools_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [111]:
# create student data frame
students_data_df = pd.DataFrame(students_data)
students_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [112]:
#merge two data frames
merge_df = pd.merge(schools_data_df, students_data_df, on ="school_name", how = "left")
merge_df

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84
...,...,...,...,...,...,...,...,...,...,...,...
39165,14,Thomas High School,Charter,1635,1043130,39165,Donna Howard,F,12th,99,90
39166,14,Thomas High School,Charter,1635,1043130,39166,Dawn Bell,F,10th,95,70
39167,14,Thomas High School,Charter,1635,1043130,39167,Rebecca Tanner,F,9th,73,84
39168,14,Thomas High School,Charter,1635,1043130,39168,Desiree Kidd,F,10th,99,90
39169,14,Thomas High School,Charter,1635,1043130,39169,Carolyn Jackson,F,11th,95,75

In [113]:
#find the total number of schools using
total_schools = schools_data_df['school_name'].count()
total_schools

15

In [114]:
#find the total number of students
total_students = merge_df['student_name'].count()
total_students

39170

In [115]:
#find the total budget for all of the schools
total_budget = schools_data_df['budget'].sum()
total_budget

24649428

In [116]:
#find average math scores for the district
math_average = merge_df['math_score'].mean()
math_average

78.98537145774827

In [117]:
#find average reading scores for the district
read_average = merge_df['reading_score'].mean()
read_average

81.87784018381414

In [118]:
#find percentage passing math
sort_stu_pass_math =merge_df[merge_df['math_score']>=70]
num_stu_pass_math =sort_stu_pass_math ['math_score'].count()
percent_pass_math=num_stu_pass_math / total_students * 100
percent_pass_math

74.9808526933878

In [119]:
#find percetage passing reading
sort_stu_pass_read =merge_df[merge_df['reading_score']>=70]
num_stu_pass_read =sort_stu_pass_read ['reading_score'].count()
percent_pass_read=num_stu_pass_read / total_students * 100
percent_pass_read

85.80546336482001

In [120]:
#find overall average score for district
overall_pass_rate = ((read_average + math_average)/2)
overall_pass_rate

80.43160582078121

In [121]:
##District Summary------------------------------------------------------------------------------------|
District_summary_df = pd.DataFrame({
    'Total Schools':[total_schools],
    'Total Students':[total_students],
    'Total Budget':[total_budget],
    'Average Math Score':[math_average],
    'Average Reading Score':[read_average],
    '% Passing Math':[percent_pass_math],
    '% Passing Reading':[percent_pass_read],
    '% Overall Passing Rate':[overall_pass_rate]})

# District Summary

In [122]:
District_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.431606

In [123]:


merge_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [124]:
schools_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [125]:
#find budget per student
budget_per_student=schools_data_df

budget_per_student['budget/student'] = budget_per_student['budget']/budget_per_student['size']
budget_per_student

    School ID            school_name      type  size   budget  budget/student
0           0      Huang High School  District  2917  1910635           655.0
1           1   Figueroa High School  District  2949  1884411           639.0
2           2    Shelton High School   Charter  1761  1056600           600.0
3           3  Hernandez High School  District  4635  3022020           652.0
4           4    Griffin High School   Charter  1468   917500           625.0
5           5     Wilson High School   Charter  2283  1319574           578.0
6           6    Cabrera High School   Charter  1858  1081356           582.0
7           7     Bailey High School  District  4976  3124928           628.0
8           8     Holden High School   Charter   427   248087           581.0
9           9       Pena High School   Charter   962   585858           609.0
10         10     Wright High School   Charter  1800  1049400           583.0
11         11  Rodriguez High School  District  3999  2547363           637.0
12         12    Johnson High School  District  4761  3094650           650.0
13         13       Ford High School  District  2739  1763916           644.0
14         14     Thomas High School   Charter  1635  1043130           638.0

In [126]:
#find average for math and reading scores by school
school_grp= schools_scores.groupby(['school_name'])
school_avg_df=school_grp.mean()
school_avg_df

                       reading_score  math_score
school_name
Bailey High School         81.033963   77.048432
Cabrera High School        83.975780   83.061895
Figueroa High School       81.158020   76.711767
Ford High School           80.746258   77.102592
Griffin High School        83.816757   83.351499
Hernandez High School      80.934412   77.289752
Holden High School         83.814988   83.803279
Huang High School          81.182722   76.629414
Johnson High School        80.966394   77.072464
Pena High School           84.044699   83.839917
Rodriguez High School      80.744686   76.842711
Shelton High School        83.725724   83.359455
Thomas High School         83.848930   83.418349
Wilson High School         83.989488   83.274201
Wright High School         83.955000   83.682222

In [127]:
#rename columns to properly reflect averages
school_avg_df.rename(columns={'reading_score':'reading_avg','math_score':'math_avg'}, inplace=True)
school_avg_df

                       reading_avg   math_avg
school_name
Bailey High School       81.033963  77.048432
Cabrera High School      83.975780  83.061895
Figueroa High School     81.158020  76.711767
Ford High School         80.746258  77.102592
Griffin High School      83.816757  83.351499
Hernandez High School    80.934412  77.289752
Holden High School       83.814988  83.803279
Huang High School        81.182722  76.629414
Johnson High School      80.966394  77.072464
Pena High School         84.044699  83.839917
Rodriguez High School    80.744686  76.842711
Shelton High School      83.725724  83.359455
Thomas High School       83.848930  83.418349
Wilson High School       83.989488  83.274201
Wright High School       83.955000  83.682222

In [ ]:
for i in school_avg_df:

In [128]:
#grouped_df=merge_df.groupby(['school_name','type']).mean()
#grouped_df.reset_index()

In [129]:
#index_df=merge_df.set_index(['school_name'])['type']
#index_df

In [130]:
##School Summary----------------------------------------------------------------------------------------|
#school_name	type	size	budget	Student ID	student_name	gender	grade	reading_score	math_score
#School_summary_df = merge_df.set_index("school_name")
#[["school_name","type","budget"]]

School_summary_df =({
    'School Type'
    'Total Students':[total_students]
    'Total School Budget'
    'Per Student Budget'
    'Average Math Score'
    'Average Reading Score'
    '% Passing Math'
    '% Passing Reading'
    'Overall Passing Rate'})
#School_summary_df

SyntaxError: invalid syntax (<ipython-input-130-1e5c2a27cf10>, line 9)

In [ ]:
merge_df.head()

In [ ]:

#1-consolidate school names
#2-assign type to school
#3-assign size as Total students
#4-assign budget
#5-find math average per school
#6-find reading average per school
#7=find percent with math score over >=70
#8-find percent with reading score >=70
#-find overall passing rates per school ((read_average + math_average)/2)7